// このファイルは build-case-index.js によって自動生成されました。
// 手動で編集しないでください。
export const caseSummaries = [
    {
        "id": "刑事訴訟法/1.捜査/1.1-10",
        "originalId": "刑事訴訟法/1.捜査/1.1-10",
        "category": "刑事訴訟法",
        "subfolder": "1.捜査",
        "title": "捜査の基本",
        "citation": "母、プリン消失事件っ！",
        "tags": [
            "刑事訴訟法",
            "捜査",
            "人権",
            "令状主義"
        ],
        "filePath": "刑事訴訟法/1.捜査/1.1-10.js",
        "lastModified": "2025-09-14T06:42:06.063Z",
        "modelAnswers": []
    },
    {
        "id": "刑事訴訟法/1.捜査/1.100-107",
        "originalId": "刑事訴訟法/1.捜査/1.100-107",
        "category": "刑事訴訟法",
        "subfolder": "1.捜査",
        "title": "捜索・差押え",
        "citation": "みかん、家宅捜索っ？",
        "tags": [
            "刑事訴訟法",
            "捜査",
            "捜索",
            "差押え",
            "令状主義"
        ],
        "filePath": "刑事訴訟法/1.捜査/1.100-107.js",
        "lastModified": "2025-09-15T07:41:01.493Z",
        "modelAnswers": []
    },
    {
        "id": "刑事訴訟法/1.捜査/1.108-116",
        "originalId": "刑事訴訟法/1.捜査/1.108-116",
        "category": "刑事訴訟法",
        "subfolder": "1.捜査",
        "title": "逮捕に伴う捜索・差押え",
        "citation": "しみちゃん、現行犯っ！",
        "tags": [
            "刑事訴訟法",
            "強制処分",
            "捜索・差押え",
            "令状主義"
        ],
        "filePath": "刑事訴訟法/1.捜査/1.108-116.js",
        "lastModified": "2025-09-15T05:41:32.608Z",
        "modelAnswers": []
    },
    {
        "id": "刑事訴訟法/1.捜査/1.11-17",
        "originalId": "刑事訴訟法/1.捜査/1.11-17",
        "category": "刑事訴訟法",
        "subfolder": "1.捜査",
        "title": "告訴",
        "citation": "みかん、犯人は２人っ！？",
        "tags": [
            "刑事訴訟法",
            "捜査",
            "告訴"
        ],
        "filePath": "刑事訴訟法/1.捜査/1.11-17.js",
        "lastModified": "2025-09-14T08:46:19.438Z",
        "modelAnswers": []
    },
    {
        "id": "刑事訴訟法/1.捜査/1.117-125",
        "originalId": "刑事訴訟法/1.捜査/1.117-125",
        "category": "刑事訴訟法",
        "subfolder": "1.捜査",
        "title": "身体検査",
        "citation": "吉岡、おしっこが出ないっ！？",
        "tags": [
            "刑事訴訟法",
            "強制処分",
            "身体検査",
            "強制採尿",
            "強制採血"
        ],
        "filePath": "刑事訴訟法/1.捜査/1.117-125.js",
        "lastModified": "2025-09-15T05:56:04.837Z",
        "modelAnswers": []
    },
    {
        "id": "刑事訴訟法/1.捜査/1.126-130",
        "originalId": "刑事訴訟法/1.捜査/1.126-130",
        "category": "刑事訴訟法",
        "subfolder": "1.捜査",
        "title": "捜査の諸原則",
        "citation": "宮嶋先生、ガサ入れっ！",
        "tags": [
            "刑事訴訟法",
            "捜査",
            "証拠収集",
            "被疑者取調べ"
        ],
        "filePath": "刑事訴訟法/1.捜査/1.126-130.js",
        "lastModified": "2025-09-15T05:59:14.782Z",
        "modelAnswers": []
    },
    {
        "id": "刑事訴訟法/1.捜査/1.131-136",
        "originalId": "刑事訴訟法/1.捜査/1.131-136",
        "category": "刑事訴訟法",
        "subfolder": "1.捜査",
        "title": "被疑者の防御権",
        "citation": "宮嶋先生、熱血指導っ",
        "tags": [
            "刑事訴訟法",
            "被疑者の権利",
            "接見交通権",
            "黙秘権"
        ],
        "filePath": "刑事訴訟法/1.捜査/1.131-136.js",
        "lastModified": "2025-09-15T05:47:40.411Z",
        "modelAnswers": []
    },
    {
        "id": "刑事訴訟法/1.捜査/1.18-29",
        "originalId": "刑事訴訟法/1.捜査/1.18-29",
        "category": "刑事訴訟法",
        "subfolder": "1.捜査",
        "title": "職務質問と所持品検査",
        "citation": "みかん、ちょっと止まりなさいっ",
        "tags": [
            "刑事訴訟法",
            "警察官職務執行法",
            "任意捜査",
            "行政警察活動"
        ],
        "filePath": "刑事訴訟法/1.捜査/1.18-29.js",
        "lastModified": "2025-11-16T03:39:10.797Z",
        "modelAnswers": []
    },
    {
        "id": "刑事訴訟法/1.捜査/1.30-38",
        "originalId": "刑事訴訟法/1.捜査/1.30-38",
        "category": "刑事訴訟法",
        "subfolder": "1.捜査",
        "title": "任意捜査の限界",
        "citation": "宮嶋先生、それって任意？",
        "tags": [
            "刑事訴訟法",
            "捜査",
            "任意捜査",
            "強制処分",
            "任意同行",
            "おとり捜査"
        ],
        "filePath": "刑事訴訟法/1.捜査/1.30-38.js",
        "lastModified": "2025-09-15T05:28:32.753Z",
        "modelAnswers": []
    },
    {
        "id": "刑事訴訟法/1.捜査/1.91-99",
        "originalId": "刑事訴訟法/1.捜査/1.91-99",
        "category": "刑事訴訟法",
        "subfolder": "1.捜査",
        "title": "捜索・差押えの基礎と手続",
        "citation": "ユズピ、捜索って何？",
        "tags": [
            "刑事訴訟法",
            "捜索",
            "差押え",
            "令状主義"
        ],
        "filePath": "刑事訴訟法/1.捜査/1.91-99.js",
        "lastModified": "2025-08-21T15:45:11.291Z",
        "modelAnswers": []
    },
    {
        "id": "刑事訴訟法/2.公訴・公判/2.1-6",
        "originalId": "刑事訴訟法/2.公訴・公判/2.1-6",
        "category": "刑事訴訟法",
        "subfolder": "2.公訴・公判",
        "title": "国家訴追主義と公訴権濫用",
        "citation": "宮嶋先生、検察官時代を語る",
        "tags": [
            "刑事訴訟法",
            "公訴提起",
            "起訴独占主義",
            "検察官裁量"
        ],
        "filePath": "刑事訴訟法/2.公訴・公判/2.1-6.js",
        "lastModified": "2025-10-06T12:26:03.539Z",
        "modelAnswers": []
    },
    {
        "id": "刑事訴訟法/2.公訴・公判/2.13-20",
        "originalId": "刑事訴訟法/2.公訴・公判/2.13-20",
        "category": "刑事訴訟法",
        "subfolder": "2.公訴・公判",
        "title": "訴因の特定",
        "citation": "宮嶋先生、しぼりこむっ",
        "tags": [
            "刑事訴訟法",
            "公訴提起",
            "訴因"
        ],
        "filePath": "刑事訴訟法/2.公訴・公判/2.13-20.js",
        "lastModified": "2025-09-15T10:25:25.077Z",
        "modelAnswers": []
    },
    {
        "id": "刑事訴訟法/2.公訴・公判/2.21-25",
        "originalId": "刑事訴訟法/2.公訴・公判/2.21-25",
        "category": "刑事訴訟法",
        "subfolder": "2.公訴・公判",
        "title": "起訴状一本主義",
        "citation": "みかん、予断まみれっ？",
        "tags": [
            "刑事訴訟法",
            "公判手続",
            "起訴状一本主義",
            "予断排除"
        ],
        "filePath": "刑事訴訟法/2.公訴・公判/2.21-25.js",
        "lastModified": "2025-09-15T10:48:33.824Z",
        "modelAnswers": []
    },
    {
        "id": "刑事訴訟法/2.公訴・公判/2.26-31",
        "originalId": "刑事訴訟法/2.公訴・公判/2.26-31",
        "category": "刑事訴訟法",
        "subfolder": "2.公訴・公判",
        "title": "公訴時効",
        "citation": "宮嶋先生、時効ギリギリっ",
        "tags": [
            "刑事訴訟法",
            "公訴時効",
            "訴訟係属"
        ],
        "filePath": "刑事訴訟法/2.公訴・公判/2.26-31.js",
        "lastModified": "2025-09-15T09:44:01.866Z",
        "modelAnswers": []
    },
    {
        "id": "刑事訴訟法/2.公訴・公判/2.50-60",
        "originalId": "刑事訴訟法/2.公訴・公判/2.50-60",
        "category": "刑事訴訟法",
        "subfolder": "2.公訴・公判",
        "title": "訴訟条件",
        "citation": "宮嶋先生、裁判がはじまらない？",
        "tags": [
            "刑事訴訟法",
            "公判",
            "訴訟条件",
            "形式裁判"
        ],
        "filePath": "刑事訴訟法/2.公訴・公判/2.50-60.js",
        "lastModified": "2025-09-15T10:20:54.362Z",
        "modelAnswers": []
    },
    {
        "id": "刑事訴訟法/2.公訴・公判/2.61-68",
        "originalId": "刑事訴訟法/2.公訴・公判/2.61-68",
        "category": "刑事訴訟法",
        "subfolder": "2.公訴・公判",
        "title": "公判手続の諸原則",
        "citation": "裁判、まだ終わらないっ？",
        "tags": [
            "刑事訴訟法",
            "公判",
            "訴因変更",
            "迅速な裁判",
            "保釈"
        ],
        "filePath": "刑事訴訟法/2.公訴・公判/2.61-68.js",
        "lastModified": "2025-09-15T10:22:23.170Z",
        "modelAnswers": []
    },
    {
        "id": "刑事訴訟法/2.公訴・公判/2.69-73",
        "originalId": "刑事訴訟法/2.公訴・公判/2.69-73",
        "category": "刑事訴訟法",
        "subfolder": "2.公訴・公判",
        "title": "公判手続の流れ",
        "citation": "しみちゃん、異議ありっ！",
        "tags": [
            "刑事訴訟法",
            "公判準備",
            "公判前整理手続",
            "公判手続"
        ],
        "filePath": "刑事訴訟法/2.公訴・公判/2.69-73.js",
        "lastModified": "2025-09-15T09:50:19.155Z",
        "modelAnswers": []
    },
    {
        "id": "刑事訴訟法/2.公訴・公判/2.7-12",
        "originalId": "刑事訴訟法/2.公訴・公判/2.7-12",
        "category": "刑事訴訟法",
        "subfolder": "2.公訴・公判",
        "title": "公訴提起の手続",
        "citation": "みかん、人違いですっ！",
        "tags": [
            "刑事訴訟法",
            "公訴提起",
            "起訴状",
            "訴因"
        ],
        "filePath": "刑事訴訟法/2.公訴・公判/2.7-12.js",
        "lastModified": "2025-09-15T08:49:49.850Z",
        "modelAnswers": []
    },
    {
        "id": "刑事訴訟法/3.証拠法/3.1-8",
        "originalId": "刑事訴訟法/3.証拠法/3.1-8",
        "category": "刑事訴訟法",
        "subfolder": "3.証拠法",
        "title": "証拠法序説",
        "citation": "ユズ、それって証拠あんの？",
        "tags": [
            "刑事訴訟法",
            "証拠法",
            "証拠能力",
            "証明力"
        ],
        "filePath": "刑事訴訟法/3.証拠法/3.1-8.js",
        "lastModified": "2025-08-30T16:01:20.738Z",
        "modelAnswers": []
    },
    {
        "id": "刑事訴訟法/3.証拠法/3.103-108",
        "originalId": "刑事訴訟法/3.証拠法/3.103-108",
        "category": "刑事訴訟法",
        "subfolder": "3.証拠法",
        "title": "共同被告人と証拠",
        "citation": "しみちゃん、沈黙は金？",
        "tags": [
            "刑事訴訟法",
            "証拠法",
            "共同被告人",
            "証人適格",
            "補強証拠"
        ],
        "filePath": "刑事訴訟法/3.証拠法/3.103-108.js",
        "lastModified": "2025-09-15T10:58:36.958Z",
        "modelAnswers": []
    },
    {
        "id": "刑事訴訟法/3.証拠法/3.20-23",
        "originalId": "刑事訴訟法/3.証拠法/3.20-23",
        "category": "刑事訴訟法",
        "subfolder": "3.証拠法",
        "title": "自由心証主義",
        "citation": "宮嶋先生、疑わしきはナニ？",
        "tags": [
            "刑事訴訟法",
            "証拠法",
            "自由心証主義"
        ],
        "filePath": "刑事訴訟法/3.証拠法/3.20-23.js",
        "lastModified": "2025-09-15T10:46:40.362Z",
        "modelAnswers": []
    },
    {
        "id": "刑事訴訟法/3.証拠法/3.24-28",
        "originalId": "刑事訴訟法/3.証拠法/3.24-28",
        "category": "刑事訴訟法",
        "subfolder": "3.証拠法",
        "title": "挙証責任",
        "citation": "宮嶋先生、疑わしいっ",
        "tags": [
            "刑事訴訟法",
            "証拠法",
            "挙証責任"
        ],
        "filePath": "刑事訴訟法/3.証拠法/3.24-28.js",
        "lastModified": "2025-09-15T10:49:21.758Z",
        "modelAnswers": []
    },
    {
        "id": "刑事訴訟法/3.証拠法/3.86-91",
        "originalId": "刑事訴訟法/3.証拠法/3.86-91",
        "category": "刑事訴訟法",
        "subfolder": "3.証拠法",
        "title": "自白法則",
        "citation": "しみちゃん、それって証拠にならない？",
        "tags": [
            "刑事訴訟法",
            "証拠法",
            "自白"
        ],
        "filePath": "刑事訴訟法/3.証拠法/3.86-91.js",
        "lastModified": "2025-09-15T11:06:59.206Z",
        "modelAnswers": []
    },
    {
        "id": "刑事訴訟法/3.証拠法/3.9-19",
        "originalId": "刑事訴訟法/3.証拠法/3.9-19",
        "category": "刑事訴訟法",
        "subfolder": "3.証拠法",
        "title": "証明",
        "citation": "先生、それって証明できるの？",
        "tags": [
            "刑事訴訟法",
            "証拠法",
            "厳格な証明",
            "自由な証明"
        ],
        "filePath": "刑事訴訟法/3.証拠法/3.9-19.js",
        "lastModified": "2025-09-15T10:46:07.999Z",
        "modelAnswers": []
    },
    {
        "id": "刑事訴訟法/3.証拠法/3.92-96",
        "originalId": "刑事訴訟法/3.証拠法/3.92-96",
        "category": "刑事訴訟法",
        "subfolder": "3.証拠法",
        "title": "自白の補強法則",
        "citation": "しみちゃん、それだけじゃダメなの？",
        "tags": [
            "刑事訴訟法",
            "証拠法",
            "自白",
            "補強法則"
        ],
        "filePath": "刑事訴訟法/3.証拠法/3.92-96.js",
        "lastModified": "2025-09-15T11:05:54.606Z",
        "modelAnswers": []
    },
    {
        "id": "刑事訴訟法/3.証拠法/3.97-102",
        "originalId": "刑事訴訟法/3.証拠法/3.97-102",
        "category": "刑事訴訟法",
        "subfolder": "3.証拠法",
        "title": "違法収集証拠排除法則",
        "citation": "吉岡、カバンの中身！",
        "tags": [
            "刑事訴訟法",
            "証拠法",
            "違法収集証拠排除法則"
        ],
        "filePath": "刑事訴訟法/3.証拠法/3.97-102.js",
        "lastModified": "2025-09-15T10:58:53.135Z",
        "modelAnswers": []
    },
    {
        "id": "刑事訴訟法/4.公判の裁判/4.1-7",
        "originalId": "刑事訴訟法/4.公判の裁判/4.1-7",
        "category": "刑事訴訟法",
        "subfolder": "4.公判の裁判",
        "title": "判決の種類と択一的認定",
        "citation": "しみちゃん、どっちの罪なの？",
        "tags": [
            "刑事訴訟法",
            "判決",
            "実体的裁判",
            "形式的裁判",
            "択一的認定",
            "犯罪の証明"
        ],
        "filePath": "刑事訴訟法/4.公判の裁判/4.1-7.js",
        "lastModified": "2025-08-25T12:23:38.296Z",
        "modelAnswers": []
    },
    {
        "id": "刑事訴訟法/4.公判の裁判/4.14-18",
        "originalId": "刑事訴訟法/4.公判の裁判/4.14-18",
        "category": "刑事訴訟法",
        "subfolder": "4.公判の裁判",
        "title": "一事不再理の範囲と免訴判決",
        "citation": "藤野、もう一度はナシだぜっ",
        "tags": [
            "刑事訴訟法",
            "一事不再理",
            "免訴判決",
            "範囲論"
        ],
        "filePath": "刑事訴訟法/4.公判の裁判/4.14-18.js",
        "lastModified": "2025-08-21T15:45:11.304Z",
        "modelAnswers": []
    },
    {
        "id": "刑事訴訟法/4.公判の裁判/4.8-13",
        "originalId": "刑事訴訟法/4.公判の裁判/4.8-13",
        "category": "刑事訴訟法",
        "subfolder": "4.公判の裁判",
        "title": "判決の効力と一事不再理",
        "citation": "ユズ、二度目は許されないっ",
        "tags": [
            "刑事訴訟法",
            "判決の効力",
            "確定力",
            "既判力",
            "一事不再理"
        ],
        "filePath": "刑事訴訟法/4.公判の裁判/4.8-13.js",
        "lastModified": "2025-08-21T15:45:11.306Z",
        "modelAnswers": []
    },
    {
        "id": "刑法/6.個人的法益に関する罪/2.132-144",
        "originalId": "刑法/6.個人的法益に関する罪/2.132-144",
        "category": "刑法",
        "subfolder": "6.個人的法益に関する罪",
        "title": "詐欺罪の諸相",
        "citation": "しみちゃん、それって詐欺じゃない？",
        "tags": [
            "刑法",
            "詐欺罪",
            "財産犯",
            "三角詐欺",
            "訴訟詐欺",
            "キセル乗車"
        ],
        "filePath": "刑法/6.個人的法益に関する罪/2.132-144.js",
        "lastModified": "2025-08-25T09:11:47.585Z",
        "modelAnswers": []
    },
    {
        "id": "刑法/6.個人的法益に関する罪/6.180-189",
        "originalId": "刑法/6.個人的法益に関する罪/6.180-189",
        "category": "刑法",
        "subfolder": "6.個人的法益に関する罪",
        "title": "盗品等に関する罪",
        "citation": "ユズヒコ、盗品に関与っ!?",
        "tags": [
            "刑法",
            "財産犯",
            "盗品等に関する罪"
        ],
        "filePath": "刑法/6.個人的法益に関する罪/6.180-189.js",
        "lastModified": "2025-08-21T15:45:11.321Z",
        "modelAnswers": []
    },
    {
        "id": "刑法/6.個人的法益に関する罪/6.190-196",
        "originalId": "刑法/6.個人的法益に関する罪/6.190-196",
        "category": "刑法",
        "subfolder": "6.個人的法益に関する罪",
        "title": "盗品等関与と器物損壊",
        "citation": "母、ワケあり骨董品っ？",
        "tags": [
            "刑法",
            "財産犯",
            "盗品等に関する罪",
            "器物損壊罪",
            "親族相盗例"
        ],
        "filePath": "刑法/6.個人的法益に関する罪/6.190-196.js",
        "lastModified": "2025-08-21T15:45:11.323Z",
        "modelAnswers": []
    },
    {
        "id": "刑法/6.個人的法益に関する罪/6.29-34",
        "originalId": "刑法/6.個人的法益に関する罪/6.29-34",
        "category": "刑法",
        "subfolder": "6.個人的法益に関する罪",
        "title": "逮捕監禁罪・脅迫罪",
        "citation": "吉岡、教室に閉じ込めるっ！？",
        "tags": [
            "刑法",
            "逮捕監禁罪",
            "脅迫罪",
            "個人の法益"
        ],
        "filePath": "刑法/6.個人的法益に関する罪/6.29-34.js",
        "lastModified": "2025-09-23T02:41:03.649Z",
        "modelAnswers": []
    },
    {
        "id": "刑法/6.個人的法益に関する罪/6.35-43",
        "originalId": "刑法/6.個人的法益に関する罪/6.35-43",
        "category": "刑法",
        "subfolder": "6.個人的法益に関する罪",
        "title": "未成年者略取・誘拐罪",
        "citation": "父、子を連れ去るっ！？",
        "tags": [
            "刑法",
            "未成年者略取罪",
            "誘拐罪",
            "保護法益",
            "親権"
        ],
        "filePath": "刑法/6.個人的法益に関する罪/6.35-43.js",
        "lastModified": "2025-08-21T15:45:11.325Z",
        "modelAnswers": []
    },
    {
        "id": "刑法/6.個人的法益に関する罪/6.44-49",
        "originalId": "刑法/6.個人的法益に関する罪/6.44-49",
        "category": "刑法",
        "subfolder": "6.個人的法益に関する罪",
        "title": "性的自由に対する罪",
        "citation": "みかん、吉岡の暴走で絶叫",
        "tags": [
            "刑法",
            "性的自由に対する罪",
            "不同意わいせつ罪",
            "不同意性交等罪"
        ],
        "filePath": "刑法/6.個人的法益に関する罪/6.44-49.js",
        "lastModified": "2025-08-21T15:45:11.326Z",
        "modelAnswers": []
    },
    {
        "id": "刑法/6.個人的法益に関する罪/6.50-56",
        "originalId": "刑法/6.個人的法益に関する罪/6.50-56",
        "category": "刑法",
        "subfolder": "6.個人的法益に関する罪",
        "title": "住居侵入罪・建造物侵入罪",
        "citation": "ユズヒコ、人の家はダメっ！",
        "tags": [
            "刑法",
            "住居侵入罪",
            "建造物侵入罪",
            "不退去罪"
        ],
        "filePath": "刑法/6.個人的法益に関する罪/6.50-56.js",
        "lastModified": "2025-08-21T15:45:11.327Z",
        "modelAnswers": []
    },
    {
        "id": "刑法/6.個人的法益に関する罪/6.57-66",
        "originalId": "刑法/6.個人的法益に関する罪/6.57-66",
        "category": "刑法",
        "subfolder": "6.個人的法益に関する罪",
        "title": "名誉毀損罪",
        "citation": "吉岡、ネットで大炎上っ！？",
        "tags": [
            "刑法",
            "社会的法益",
            "名誉毀損罪",
            "侮辱罪",
            "表現の自由"
        ],
        "filePath": "刑法/6.個人的法益に関する罪/6.57-66.js",
        "lastModified": "2025-08-21T15:45:11.328Z",
        "modelAnswers": []
    },
    {
        "id": "刑法/6.個人的法益に関する罪/6.67-73",
        "originalId": "刑法/6.個人的法益に関する罪/6.67-73",
        "category": "刑法",
        "subfolder": "6.個人的法益に関する罪",
        "title": "信用毀損罪・業務妨害罪",
        "citation": "ナスオ、ウソのうわさっ",
        "tags": [
            "刑法",
            "信用毀損罪",
            "業務妨害罪",
            "刑法233条"
        ],
        "filePath": "刑法/6.個人的法益に関する罪/6.67-73.js",
        "lastModified": "2025-08-21T15:45:11.329Z",
        "modelAnswers": []
    },
    {
        "id": "刑法/7.社会的法益に関する罪/7.1-12",
        "originalId": "刑法/7.社会的法益に関する罪/7.1-12",
        "category": "刑法",
        "subfolder": "7.社会的法益に関する罪",
        "title": "放火罪と失火罪",
        "citation": "父、ベランダでキャンプファイヤー？",
        "tags": [
            "刑法",
            "放火罪",
            "失火罪",
            "公共の危険",
            "現住建造物"
        ],
        "filePath": "刑法/7.社会的法益に関する罪/7.1-12.js",
        "lastModified": "2025-08-21T15:45:11.330Z",
        "modelAnswers": []
    },
    {
        "id": "刑法/7.社会的法益に関する罪/7.13-19",
        "originalId": "刑法/7.社会的法益に関する罪/7.13-19",
        "category": "刑法",
        "subfolder": "7.社会的法益に関する罪",
        "title": "文書の偽造",
        "citation": "吉岡、サインは自分でっ！",
        "tags": [
            "刑法",
            "文書偽造罪",
            "有形偽造",
            "名義人"
        ],
        "filePath": "刑法/7.社会的法益に関する罪/7.13-19.js",
        "lastModified": "2025-08-21T15:45:11.332Z",
        "modelAnswers": []
    },
    {
        "id": "刑法/7.社会的法益に関する罪/7.20-24",
        "originalId": "刑法/7.社会的法益に関する罪/7.20-24",
        "category": "刑法",
        "subfolder": "7.社会的法益に関する罪",
        "title": "コピー文書と偽造",
        "citation": "母、なんでもコピーっ！",
        "tags": [
            "刑法",
            "文書偽造罪",
            "文書の意義",
            "変造",
            "コピー"
        ],
        "filePath": "刑法/7.社会的法益に関する罪/7.20-24.js",
        "lastModified": "2025-08-21T15:45:11.332Z",
        "modelAnswers": []
    },
    {
        "id": "刑法/7.社会的法益に関する罪/7.25-36",
        "originalId": "刑法/7.社会的法益に関する罪/7.25-36",
        "category": "刑法",
        "subfolder": "7.社会的法益に関する罪",
        "title": "公文書と私文書の偽造・行使",
        "citation": "母、契約書はよく読んでっ！",
        "tags": [
            "刑法",
            "文書偽造罪",
            "虚偽公文書作成罪",
            "行使罪",
            "構成要件"
        ],
        "filePath": "刑法/7.社会的法益に関する罪/7.25-36.js",
        "lastModified": "2025-08-25T11:09:41.536Z",
        "modelAnswers": []
    },
    {
        "id": "刑法/8.国家的法益に関する罪/8.1-6",
        "originalId": "刑法/8.国家的法益に関する罪/8.1-6",
        "category": "刑法",
        "subfolder": "8.国家的法益に関する罪",
        "title": "公務執行妨害罪",
        "citation": "父、知らんでは済まないっ？",
        "tags": [
            "刑法",
            "公務執行妨害罪",
            "国家的法益"
        ],
        "filePath": "刑法/8.国家的法益に関する罪/8.1-6.js",
        "lastModified": "2025-08-21T15:45:11.334Z",
        "modelAnswers": []
    },
    {
        "id": "刑法/8.国家的法益に関する罪/8.13-22",
        "originalId": "刑法/8.国家的法益に関する罪/8.13-22",
        "category": "刑法",
        "subfolder": "8.国家的法益に関する罪",
        "title": "証拠隠滅と偽証",
        "citation": "みかん、口裏合わせっ",
        "tags": [
            "刑法",
            "証拠隠滅罪",
            "偽証罪",
            "国家法益"
        ],
        "filePath": "刑法/8.国家的法益に関する罪/8.13-22.js",
        "lastModified": "2025-08-21T15:45:11.334Z",
        "modelAnswers": []
    },
    {
        "id": "刑法/8.国家的法益に関する罪/8.23-32",
        "originalId": "刑法/8.国家的法益に関する罪/8.23-32",
        "category": "刑法",
        "subfolder": "8.国家的法益に関する罪",
        "title": "収賄罪",
        "citation": "原先生、保護者からの贈り物っ",
        "tags": [
            "刑法",
            "収賄罪"
        ],
        "filePath": "刑法/8.国家的法益に関する罪/8.23-32.js",
        "lastModified": "2025-08-21T15:45:11.335Z",
        "modelAnswers": []
    },
    {
        "id": "刑法/8.国家的法益に関する罪/8.7-12",
        "originalId": "刑法/8.国家的法益に関する罪/8.7-12",
        "category": "刑法",
        "subfolder": "8.国家的法益に関する罪",
        "title": "犯人蔵匿と証拠隠滅",
        "citation": "吉岡、かくまってちょうだいっ！？",
        "tags": [
            "刑法",
            "犯人蔵匿罪",
            "犯人隠避罪",
            "国家法益"
        ],
        "filePath": "刑法/8.国家的法益に関する罪/8.7-12.js",
        "lastModified": "2025-08-21T15:45:11.336Z",
        "modelAnswers": []
    },
    {
        "id": "商法/1.商法総則・商行為/1.1-11",
        "originalId": "商法/1.商法総則・商行為/1.1-11",
        "category": "商法",
        "subfolder": "1.商法総則・商行為",
        "title": "商号と名板貸人の責任",
        "citation": "みかん、名前を貸しちゃダメっ！",
        "tags": [
            "商法",
            "商法総則",
            "商号",
            "名板貸"
        ],
        "filePath": "商法/1.商法総則・商行為/1.1-11.js",
        "lastModified": "2025-11-16T15:25:41.175Z",
        "modelAnswers": []
    },
    {
        "id": "商法/1.商法総則・商行為/1.12-18",
        "originalId": "商法/1.商法総則・商行為/1.12-18",
        "category": "商法",
        "subfolder": "1.商法総則・商行為",
        "title": "営業譲渡と表見責任",
        "citation": "吉岡、会社を継ぐっ？",
        "tags": [
            "商法",
            "会社法",
            "営業譲渡",
            "表見支配人",
            "商号続用"
        ],
        "filePath": "商法/1.商法総則・商行為/1.12-18.js",
        "lastModified": "2025-09-15T11:54:18.264Z",
        "modelAnswers": []
    },
    {
        "id": "商法/2.会社法総論・設立・株式/2.1-5",
        "originalId": "商法/2.会社法総論・設立・株式/2.1-5",
        "category": "商法",
        "subfolder": "2.会社法総論・設立・株式",
        "title": "一人会社と法人格否認の法理",
        "citation": "父、社長になるっ",
        "tags": [
            "会社法",
            "一人会社",
            "法人格否認の法理",
            "株主総会"
        ],
        "filePath": "商法/2.会社法総論・設立・株式/2.1-5.js",
        "lastModified": "2025-08-29T15:58:40.885Z",
        "modelAnswers": []
    },
    {
        "id": "商法/2.会社法総論・設立・株式/2.13-20",
        "originalId": "商法/2.会社法総論・設立・株式/2.13-20",
        "category": "商法",
        "subfolder": "2.会社法総論・設立・株式",
        "title": "会社設立",
        "citation": "吉岡、会社つくるっ！",
        "tags": [
            "会社法",
            "設立"
        ],
        "filePath": "商法/2.会社法総論・設立・株式/2.13-20.js",
        "lastModified": "2025-08-28T15:24:17.728Z",
        "modelAnswers": []
    },
    {
        "id": "商法/2.会社法総論・設立・株式/2.6-12",
        "originalId": "商法/2.会社法総論・設立・株式/2.6-12",
        "category": "商法",
        "subfolder": "2.会社法総論・設立・株式",
        "title": "預合いと見せ金",
        "citation": "吉岡、資本の壁っ！",
        "tags": [
            "会社法",
            "株式",
            "会社設立",
            "預合い",
            "見せ金"
        ],
        "filePath": "商法/2.会社法総論・設立・株式/2.6-12.js",
        "lastModified": "2025-08-29T16:25:20.202Z",
        "modelAnswers": []
    },
    {
        "id": "商法/3.機関/3.1-8",
        "originalId": "商法/3.機関/3.1-8",
        "category": "商法",
        "subfolder": "3.機関",
        "title": "株主総会の運営と決議",
        "citation": "吉岡、株主総会は大変っ",
        "tags": [
            "会社法",
            "株主総会",
            "決議",
            "代理権",
            "説明義務"
        ],
        "filePath": "商法/3.機関/3.1-8.js",
        "lastModified": "2025-09-15T12:40:03.014Z",
        "modelAnswers": []
    },
    {
        "id": "商法/3.機関/3.16-20",
        "originalId": "商法/3.機関/3.16-20",
        "category": "商法",
        "subfolder": "3.機関",
        "title": "株主総会決議の不存在・取消し",
        "citation": "吉岡、会社のハンコがないっ！",
        "tags": [
            "会社法",
            "株主総会",
            "訴えの利益"
        ],
        "filePath": "商法/3.機関/3.16-20.js",
        "lastModified": "2025-10-02T03:51:03.282Z",
        "modelAnswers": []
    },
    {
        "id": "商法/3.機関/3.21-27",
        "originalId": "商法/3.機関/3.21-27",
        "category": "商法",
        "subfolder": "3.機関",
        "title": "取締役の解任と取締役会",
        "citation": "吉岡、会社ごっこっ？",
        "tags": [
            "会社法",
            "機関",
            "取締役",
            "取締役会",
            "役員解任"
        ],
        "filePath": "商法/3.機関/3.21-27.js",
        "lastModified": "2025-09-15T12:41:16.899Z",
        "modelAnswers": []
    },
    {
        "id": "商法/3.機関/3.28-35",
        "originalId": "商法/3.機関/3.28-35",
        "category": "商法",
        "subfolder": "3.機関",
        "title": "取締役会の権限と取締役の義務",
        "citation": "吉岡、会社って大変！",
        "tags": [
            "会社法",
            "機関",
            "取締役会",
            "代表取締役",
            "取締役の責任"
        ],
        "filePath": "商法/3.機関/3.28-35.js",
        "lastModified": "2025-09-15T12:41:29.313Z",
        "modelAnswers": []
    },
    {
        "id": "商法/3.機関/3.36-44",
        "originalId": "商法/3.機関/3.36-44",
        "category": "商法",
        "subfolder": "3.機関",
        "title": "競業取引・利益相反取引",
        "citation": "吉岡、会社のピンチっ",
        "tags": [
            "会社法",
            "取締役",
            "競業避止義務",
            "利益相反取引"
        ],
        "filePath": "商法/3.機関/3.36-44.js",
        "lastModified": "2025-09-15T12:41:41.947Z",
        "modelAnswers": []
    },
    {
        "id": "商法/3.機関/3.45-51",
        "originalId": "商法/3.機関/3.45-51",
        "category": "商法",
        "subfolder": "3.機関",
        "title": "取締役の報酬",
        "citation": "吉岡、会社のオカネっ",
        "tags": [
            "会社法",
            "機関",
            "取締役",
            "報酬",
            "退職慰労金"
        ],
        "filePath": "商法/3.機関/3.45-51.js",
        "lastModified": "2025-09-15T12:41:47.675Z",
        "modelAnswers": []
    },
    {
        "id": "商法/3.機関/3.52-55",
        "originalId": "商法/3.機関/3.52-55",
        "category": "商法",
        "subfolder": "3.機関",
        "title": "任務懈怠責任",
        "citation": "吉岡、悩んでる？",
        "tags": [
            "会社法",
            "役員責任",
            "経営判断原則"
        ],
        "filePath": "商法/3.機関/3.52-55.js",
        "lastModified": "2025-09-15T12:48:47.478Z",
        "modelAnswers": []
    },
    {
        "id": "商法/3.機関/3.56-59",
        "originalId": "商法/3.機関/3.56-59",
        "category": "商法",
        "subfolder": "3.機関",
        "title": "利益供与",
        "citation": "吉岡、会社は大変っ",
        "tags": [
            "会社法",
            "利益供与",
            "株主の権利",
            "取締役の責任"
        ],
        "filePath": "商法/3.機関/3.56-59.js",
        "lastModified": "2025-09-15T12:48:58.977Z",
        "modelAnswers": []
    },
    {
        "id": "商法/3.機関/3.60-67",
        "originalId": "商法/3.機関/3.60-67",
        "category": "商法",
        "subfolder": "3.機関",
        "title": "役員等の第三者に対する責任",
        "citation": "岩城くん、名ばかり取締役っ",
        "tags": [
            "会社法",
            "役員等の責任",
            "第三者責任",
            "会社法429条"
        ],
        "filePath": "商法/3.機関/3.60-67.js",
        "lastModified": "2025-10-03T15:07:29.917Z",
        "modelAnswers": []
    },
    {
        "id": "商法/3.機関/3.68-72",
        "originalId": "商法/3.機関/3.68-72",
        "category": "商法",
        "subfolder": "3.機関",
        "title": "株主代表訴訟と監査役制度",
        "citation": "みかん、監査役に立候補っ？",
        "tags": [
            "会社法",
            "株主代表訴訟",
            "監査役",
            "機関"
        ],
        "filePath": "商法/3.機関/3.68-72.js",
        "lastModified": "2025-10-02T03:30:10.495Z",
        "modelAnswers": []
    },
    {
        "id": "商法/3.機関/3.9-15",
        "originalId": "商法/3.機関/3.9-15",
        "category": "商法",
        "subfolder": "3.機関",
        "title": "株主総会決議取消しの訴え",
        "citation": "理央、株主総会で大モメっ？",
        "tags": [
            "会社法",
            "株主総会",
            "決議の瑕疵"
        ],
        "filePath": "商法/3.機関/3.9-15.js",
        "lastModified": "2025-10-02T06:07:33.150Z",
        "modelAnswers": []
    },
    {
        "id": "商法/4.計算・資金調達・組織/4.1-8",
        "originalId": "商法/4.計算・資金調達・組織/4.1-8",
        "category": "商法",
        "subfolder": "4.計算・資金調達・組織",
        "title": "剰余金の分配と新株発行",
        "citation": "吉岡、会社がピンチっ！？",
        "tags": [
            "会社法",
            "剰余金の分配",
            "違法配当",
            "有利発行",
            "新株発行差止請求"
        ],
        "filePath": "商法/4.計算・資金調達・組織/4.1-8.js",
        "lastModified": "2025-08-27T13:34:17.364Z",
        "modelAnswers": []
    },
    {
        "id": "商法/4.計算・資金調達・組織/4.17-20",
        "originalId": "商法/4.計算・資金調達・組織/4.17-20",
        "category": "商法",
        "subfolder": "4.計算・資金調達・組織",
        "title": "新株予約権と敵対的買収",
        "citation": "吉岡、会社を救うっ？",
        "tags": [
            "会社法",
            "新株予約権",
            "敵対的買収",
            "株式発行",
            "株主平等原則"
        ],
        "filePath": "商法/4.計算・資金調達・組織/4.17-20.js",
        "lastModified": "2025-08-27T14:14:56.613Z",
        "modelAnswers": []
    },
    {
        "id": "商法/4.計算・資金調達・組織/4.21-27",
        "originalId": "商法/4.計算・資金調達・組織/4.21-27",
        "category": "商法",
        "subfolder": "4.計算・資金調達・組織",
        "title": "事業譲渡と組織再編",
        "citation": "吉岡、会社を売るっ!?",
        "tags": [
            "会社法",
            "事業譲渡",
            "組織再編",
            "M&A"
        ],
        "filePath": "商法/4.計算・資金調達・組織/4.21-27.js",
        "lastModified": "2025-08-27T10:01:02.795Z",
        "modelAnswers": []
    },
    {
        "id": "商法/4.計算・資金調達・組織/4.9-16",
        "originalId": "商法/4.計算・資金調達・組織/4.9-16",
        "category": "商法",
        "subfolder": "4.計算・資金調達・組織",
        "title": "募集株式発行の無効",
        "citation": "吉岡、会社の株でもめるっ",
        "tags": [
            "会社法",
            "株式",
            "募集株式発行",
            "無効の訴え"
        ],
        "filePath": "商法/4.計算・資金調達・組織/4.9-16.js",
        "lastModified": "2025-08-27T14:35:08.533Z",
        "modelAnswers": []
    },
    {
        "id": "民事訴訟法/1.序論～訴訟当事者/1.1-8",
        "originalId": "民事訴訟法/1.序論～訴訟当事者/1.1-8",
        "category": "民事訴訟法",
        "subfolder": "1.序論～訴訟当事者",
        "title": "当事者の確定",
        "citation": "ユズヒコ、被告は誰だっ？",
        "tags": [
            "民事訴訟法",
            "当事者",
            "訴訟要件",
            "氏名冒用",
            "死者名義訴訟"
        ],
        "filePath": "民事訴訟法/1.序論～訴訟当事者/1.1-8.js",
        "lastModified": "2025-08-25T12:24:32.038Z",
        "modelAnswers": []
    },
    {
        "id": "民事訴訟法/1.序論～訴訟当事者/1.17-27",
        "originalId": "民事訴訟法/1.序論～訴訟当事者/1.17-27",
        "category": "民事訴訟法",
        "subfolder": "1.序論～訴訟当事者",
        "title": "訴訟能力と訴訟代理",
        "citation": "ユズ、法廷に立つ？",
        "tags": [
            "民事訴訟法",
            "当事者",
            "訴訟能力",
            "訴訟代理"
        ],
        "filePath": "民事訴訟法/1.序論～訴訟当事者/1.17-27.js",
        "lastModified": "2025-09-14T12:33:12.178Z",
        "modelAnswers": []
    },
    {
        "id": "民事訴訟法/1.序論～訴訟当事者/1.9-16",
        "originalId": "民事訴訟法/1.序論～訴訟当事者/1.9-16",
        "category": "民事訴訟法",
        "subfolder": "1.序論～訴訟当事者",
        "title": "当事者能力",
        "citation": "ユズヒコ、サークルで訴えられる!?",
        "tags": [
            "民事訴訟法",
            "当事者能力",
            "法人格なき社団",
            "訴訟要件",
            "当事者適格"
        ],
        "filePath": "民事訴訟法/1.序論～訴訟当事者/1.9-16.js",
        "lastModified": "2025-08-21T15:45:11.362Z",
        "modelAnswers": []
    },
    {
        "id": "民事訴訟法/2.訴えの提起/2.1-8",
        "originalId": "民事訴訟法/2.訴えの提起/2.1-8",
        "category": "民事訴訟法",
        "subfolder": "2.訴えの提起",
        "title": "訴えの提起と種類",
        "citation": "父の土地、境界線はどこっ？",
        "tags": [
            "民事訴訟法",
            "訴えの提起",
            "訴えの種類",
            "境界確定訴訟",
            "訴訟物"
        ],
        "filePath": "民事訴訟法/2.訴えの提起/2.1-8.js",
        "lastModified": "2025-08-21T15:45:11.362Z",
        "modelAnswers": []
    },
    {
        "id": "民事訴訟法/2.訴えの提起/2.15-21",
        "originalId": "民事訴訟法/2.訴えの提起/2.15-21",
        "category": "民事訴訟法",
        "subfolder": "2.訴えの提起",
        "title": "建物収去土地明渡請求",
        "citation": "原先生、立ち退きは大変っ",
        "tags": [
            "民事訴訟法",
            "物権法",
            "借地借家法"
        ],
        "filePath": "民事訴訟法/2.訴えの提起/2.15-21.js",
        "lastModified": "2025-09-14T23:26:43.033Z",
        "modelAnswers": []
    },
    {
        "id": "民事訴訟法/2.訴えの提起/2.22-31",
        "originalId": "民事訴訟法/2.訴えの提起/2.22-31",
        "category": "民事訴訟法",
        "subfolder": "2.訴えの提起",
        "title": "訴訟物の特定と一部請求",
        "citation": "ユズ、請求はハッキリと！",
        "tags": [
            "民事訴訟法",
            "訴訟物",
            "一部請求",
            "債務不存在確認訴訟",
            "既判力"
        ],
        "filePath": "民事訴訟法/2.訴えの提起/2.22-31.js",
        "lastModified": "2025-09-14T23:53:52.516Z",
        "modelAnswers": []
    },
    {
        "id": "民事訴訟法/2.訴えの提起/2.32-35",
        "originalId": "民事訴訟法/2.訴えの提起/2.32-35",
        "category": "民事訴訟法",
        "subfolder": "2.訴えの提起",
        "title": "既判力の客観的範囲",
        "citation": "藤野、ケガは治ったはずっ!?",
        "tags": [
            "民事訴訟法",
            "不法行為",
            "損害賠償",
            "既判力"
        ],
        "filePath": "民事訴訟法/2.訴えの提起/2.32-35.js",
        "lastModified": "2025-09-15T00:40:07.149Z",
        "modelAnswers": []
    },
    {
        "id": "民事訴訟法/2.訴えの提起/2.9-14",
        "originalId": "民事訴訟法/2.訴えの提起/2.9-14",
        "category": "民事訴訟法",
        "subfolder": "2.訴えの提起",
        "title": "処分権主義と判決の範囲",
        "citation": "父、訴えられてないコトっ",
        "tags": [
            "民事訴訟法",
            "処分権主義",
            "判決の範囲",
            "一部認容",
            "民事訴訟法246条"
        ],
        "filePath": "民事訴訟法/2.訴えの提起/2.9-14.js",
        "lastModified": "2025-08-21T15:45:11.363Z",
        "modelAnswers": []
    },
    {
        "id": "民事訴訟法/3.訴訟の審理と進行/3.1-8",
        "originalId": "民事訴訟法/3.訴訟の審理と進行/3.1-8",
        "category": "民事訴訟法",
        "subfolder": "3.訴訟の審理と進行",
        "title": "時機に後れた攻撃防御方法",
        "citation": "川島、時機に後れた恋心っ？",
        "tags": [
            "民事訴訟法",
            "攻撃防御方法",
            "送達",
            "訴訟手続"
        ],
        "filePath": "民事訴訟法/3.訴訟の審理と進行/3.1-8.js",
        "lastModified": "2025-09-15T00:52:51.114Z",
        "modelAnswers": []
    },
    {
        "id": "民事訴訟法/3.訴訟の審理と進行/3.16-22",
        "originalId": "民事訴訟法/3.訴訟の審理と進行/3.16-22",
        "category": "民事訴訟法",
        "subfolder": "3.訴訟の審理と進行",
        "title": "訴訟行為と訴訟契約",
        "citation": "ユズ、それって契約違反？",
        "tags": [
            "民事訴訟法",
            "訴訟行為",
            "訴訟契約",
            "相殺"
        ],
        "filePath": "民事訴訟法/3.訴訟の審理と進行/3.16-22.js",
        "lastModified": "2025-09-15T02:01:29.067Z",
        "modelAnswers": []
    },
    {
        "id": "民事訴訟法/3.訴訟の審理と進行/3.23-30",
        "originalId": "民事訴訟法/3.訴訟の審理と進行/3.23-30",
        "category": "民事訴訟法",
        "subfolder": "3.訴訟の審理と進行",
        "title": "弁論主義",
        "citation": "ハラセン、言ってない事実！",
        "tags": [
            "民事訴訟法",
            "弁論主義",
            "主要事実"
        ],
        "filePath": "民事訴訟法/3.訴訟の審理と進行/3.23-30.js",
        "lastModified": "2025-09-15T02:26:04.901Z",
        "modelAnswers": []
    },
    {
        "id": "民事訴訟法/3.訴訟の審理と進行/3.31-33",
        "originalId": "民事訴訟法/3.訴訟の審理と進行/3.31-33",
        "category": "民事訴訟法",
        "subfolder": "3.訴訟の審理と進行",
        "title": "主張の構造",
        "citation": "ユズ、それって主張してない？",
        "tags": [
            "民事訴訟法",
            "弁論主義",
            "抗弁"
        ],
        "filePath": "民事訴訟法/3.訴訟の審理と進行/3.31-33.js",
        "lastModified": "2025-09-15T03:00:56.716Z",
        "modelAnswers": []
    },
    {
        "id": "民事訴訟法/3.訴訟の審理と進行/3.34-40",
        "originalId": "民事訴訟法/3.訴訟の審理と進行/3.34-40",
        "category": "民事訴訟法",
        "subfolder": "3.訴訟の審理と進行",
        "title": "釈明権",
        "citation": "ハラセン、それってヒント？",
        "tags": [
            "民事訴訟法",
            "弁論主義",
            "釈明権"
        ],
        "filePath": "民事訴訟法/3.訴訟の審理と進行/3.34-40.js",
        "lastModified": "2025-09-15T03:08:25.808Z",
        "modelAnswers": []
    },
    {
        "id": "民事訴訟法/3.訴訟の審理と進行/3.9-15",
        "originalId": "民事訴訟法/3.訴訟の審理と進行/3.9-15",
        "category": "民事訴訟法",
        "subfolder": "3.訴訟の審理と進行",
        "title": "事実主張に対する相手方の態度",
        "citation": "山下、その沈黙は認めないっ！",
        "tags": [
            "民事訴訟法",
            "弁論主義",
            "当事者の主張",
            "自白",
            "否認",
            "抗弁"
        ],
        "filePath": "民事訴訟法/3.訴訟の審理と進行/3.9-15.js",
        "lastModified": "2025-08-21T15:45:11.366Z",
        "modelAnswers": []
    },
    {
        "id": "民事訴訟法/4.訴訟の終了/4.1-8",
        "originalId": "民事訴訟法/4.訴訟の終了/4.1-8",
        "category": "民事訴訟法",
        "subfolder": "4.訴訟の終了",
        "title": "訴訟の終了事由",
        "citation": "原先生、それは再訴禁止っ！",
        "tags": [
            "民事訴訟法",
            "訴えの取下げ",
            "請求の放棄",
            "請求の認諾",
            "訴訟上の和解"
        ],
        "filePath": "民事訴訟法/4.訴訟の終了/4.1-8.js",
        "lastModified": "2025-08-25T09:37:26.303Z",
        "modelAnswers": []
    },
    {
        "id": "民事訴訟法/4.訴訟の終了/4.18-24",
        "originalId": "民事訴訟法/4.訴訟の終了/4.18-24",
        "category": "民事訴訟法",
        "subfolder": "4.訴訟の終了",
        "title": "既判力",
        "citation": "ユズ、蒸し返しはナシっ",
        "tags": [
            "民事訴訟法",
            "既判力",
            "遮断効",
            "相殺",
            "争点効"
        ],
        "filePath": "民事訴訟法/4.訴訟の終了/4.18-24.js",
        "lastModified": "2025-08-25T16:43:40.659Z",
        "modelAnswers": []
    },
    {
        "id": "民事訴訟法/4.訴訟の終了/4.25-32",
        "originalId": "民事訴訟法/4.訴訟の終了/4.25-32",
        "category": "民事訴訟法",
        "subfolder": "4.訴訟の終了",
        "title": "既判力の主観的範囲",
        "citation": "ハラセン、判決のその後っ",
        "tags": [
            "民事訴訟法",
            "既判力",
            "主観的範囲",
            "法人格否認の法理"
        ],
        "filePath": "民事訴訟法/4.訴訟の終了/4.25-32.js",
        "lastModified": "2025-08-25T12:25:40.319Z",
        "modelAnswers": []
    },
    {
        "id": "民事訴訟法/4.訴訟の終了/4.9-17",
        "originalId": "民事訴訟法/4.訴訟の終了/4.9-17",
        "category": "民事訴訟法",
        "subfolder": "4.訴訟の終了",
        "title": "判決の効力",
        "citation": "ナスオ、もう言えないっ",
        "tags": [
            "民事訴訟法",
            "判決",
            "中間判決",
            "既判力"
        ],
        "filePath": "民事訴訟法/4.訴訟の終了/4.9-17.js",
        "lastModified": "2025-08-25T08:58:25.529Z",
        "modelAnswers": []
    },
    {
        "id": "民事訴訟法/5.請求・当事者の複数/5.46-51",
        "originalId": "民事訴訟法/5.請求・当事者の複数/5.46-51",
        "category": "民事訴訟法",
        "subfolder": "5.請求・当事者の複数",
        "title": "補助参加と訴訟告知",
        "citation": "ユズヒコ、訴訟に参加っ？",
        "tags": [
            "民事訴訟法",
            "訴訟参加",
            "補助参加",
            "訴訟告知",
            "参加的効力"
        ],
        "filePath": "民事訴訟法/5.請求・当事者の複数/5.46-51.js",
        "lastModified": "2025-08-25T09:11:47.600Z",
        "modelAnswers": []
    },
    {
        "id": "民事訴訟法/5.請求・当事者の複数/5.64-73",
        "originalId": "民事訴訟法/5.請求・当事者の複数/5.64-73",
        "category": "民事訴訟法",
        "subfolder": "5.請求・当事者の複数",
        "title": "上訴・控訴",
        "citation": "父、白黒つけたいっ",
        "tags": [
            "民事訴訟法",
            "上訴",
            "控訴",
            "控訴審",
            "不利益変更禁止の原則"
        ],
        "filePath": "民事訴訟法/5.請求・当事者の複数/5.64-73.js",
        "lastModified": "2025-08-25T15:49:05.296Z",
        "modelAnswers": []
    },
    {
        "id": "民事訴訟法/5.請求・当事者の複数/5.74-80",
        "originalId": "民事訴訟法/5.請求・当事者の複数/5.74-80",
        "category": "民事訴訟法",
        "subfolder": "5.請求・当事者の複数",
        "title": "上告と再審",
        "citation": "ハラセン、最後の手段っ",
        "tags": [
            "民事訴訟法",
            "上訴",
            "上告",
            "再審"
        ],
        "filePath": "民事訴訟法/5.請求・当事者の複数/5.74-80.js",
        "lastModified": "2025-09-13T00:29:38.308Z",
        "modelAnswers": []
    },
    {
        "id": "民法/1.民法総則/1.65-75",
        "originalId": "民法/1.民法総則/1.65-75",
        "category": "民法",
        "subfolder": "1.民法総則",
        "title": "有権代理の基本構造",
        "citation": "ユズヒコ、代理人になるっ！？",
        "tags": [
            "民法",
            "民法総則",
            "代理",
            "有権代理",
            "顕名",
            "代理権"
        ],
        "filePath": "民法/1.民法総則/1.65-75.js",
        "lastModified": "2025-08-25T09:11:47.604Z",
        "modelAnswers": []
    },
    {
        "id": "民法/1.民法総則/1.83-95",
        "originalId": "民法/1.民法総則/1.83-95",
        "category": "民法",
        "subfolder": "1.民法総則",
        "title": "無権代理と相続",
        "citation": "父さん、その土地は誰のもの？",
        "tags": [
            "民法",
            "民法総則",
            "代理",
            "無権代理",
            "表見代理",
            "相続"
        ],
        "filePath": "民法/1.民法総則/1.83-95.js",
        "lastModified": "2025-08-25T09:11:47.604Z",
        "modelAnswers": []
    },
    {
        "id": "民法/1.民法総則/1.96-113",
        "originalId": "民法/1.民法総則/1.96-113",
        "category": "民法",
        "subfolder": "1.民法総則",
        "title": "表見代理の諸相",
        "citation": "お父さん、その契約、無効じゃないの？",
        "tags": [
            "民法",
            "民法総則",
            "代理",
            "表見代理",
            "109条",
            "110条",
            "112条"
        ],
        "filePath": "民法/1.民法総則/1.96-113.js",
        "lastModified": "2025-08-21T15:45:11.372Z",
        "modelAnswers": []
    },
    {
        "id": "民法/2.物権/2.32-42",
        "originalId": "民法/2.物権/2.32-42",
        "category": "民法",
        "subfolder": "2.物権",
        "title": "動産物権変動と即時取得",
        "citation": "みかん、そのカメラ大丈夫！？",
        "tags": [
            "民法",
            "物権変動",
            "動産",
            "引渡し",
            "即時取得",
            "占有改定"
        ],
        "filePath": "民法/2.物権/2.32-42.js",
        "lastModified": "2025-08-25T09:11:47.613Z",
        "modelAnswers": []
    },
    {
        "id": "民法/3.担保物権/3.1-10",
        "originalId": "民法/3.担保物権/3.1-10",
        "category": "民法",
        "subfolder": "3.担保物権",
        "title": "留置権と質権",
        "citation": "ユズピ、質入れで大ピンチっ",
        "tags": [
            "民法",
            "物権法",
            "担保物権",
            "留置権",
            "質権"
        ],
        "filePath": "民法/3.担保物権/3.1-10.js",
        "lastModified": "2025-11-15T13:09:12.791Z",
        "modelAnswers": []
    },
    {
        "id": "民法/3.担保物権/3.11-19",
        "originalId": "民法/3.担保物権/3.11-19",
        "category": "民法",
        "subfolder": "3.担保物権",
        "title": "抵当権の効力",
        "citation": "ユズ、担保って大変っ",
        "tags": [
            "民法",
            "物権",
            "担保物権",
            "抵当権"
        ],
        "filePath": "民法/3.担保物権/3.11-19.js",
        "lastModified": "2025-11-15T16:17:26.022Z",
        "modelAnswers": []
    },
    {
        "id": "民法/3.担保物権/3.20-29",
        "originalId": "民法/3.担保物権/3.20-29",
        "category": "民法",
        "subfolder": "3.担保物権",
        "title": "物上代位",
        "citation": "ハラセン、燃えた家の行方",
        "tags": [
            "民法",
            "物権法",
            "担保物権",
            "抵当権",
            "物上代位"
        ],
        "filePath": "民法/3.担保物権/3.20-29.js",
        "lastModified": "2025-09-15T13:08:46.661Z",
        "modelAnswers": []
    },
    {
        "id": "民法/3.担保物権/3.30-36",
        "originalId": "民法/3.担保物権/3.30-36",
        "category": "民法",
        "subfolder": "3.担保物権",
        "title": "抵当権の侵害",
        "citation": "ユズ、他人の土地に小屋っ？",
        "tags": [
            "民法",
            "物権法",
            "担保物権",
            "抵当権"
        ],
        "filePath": "民法/3.担保物権/3.30-36.js",
        "lastModified": "2025-09-15T13:09:17.979Z",
        "modelAnswers": []
    },
    {
        "id": "民法/3.担保物権/3.37-48",
        "originalId": "民法/3.担保物権/3.37-48",
        "category": "民法",
        "subfolder": "3.担保物権",
        "title": "法定地上権",
        "citation": "ユズ、家がなくなる？",
        "tags": [
            "民法",
            "物権法",
            "担保物権",
            "法定地上権"
        ],
        "filePath": "民法/3.担保物権/3.37-48.js",
        "lastModified": "2025-09-15T13:09:09.278Z",
        "modelAnswers": []
    },
    {
        "id": "民法/3.担保物権/3.49-53",
        "originalId": "民法/3.担保物権/3.49-53",
        "category": "民法",
        "subfolder": "3.担保物権",
        "title": "譲渡担保",
        "citation": "藤野、店ごと担保っ！？",
        "tags": [
            "民法",
            "物権法",
            "担保物権",
            "譲渡担保"
        ],
        "filePath": "民法/3.担保物権/3.49-53.js",
        "lastModified": "2025-09-15T13:09:28.415Z",
        "modelAnswers": []
    },
    {
        "id": "民法/3.担保物権/3.54-62",
        "originalId": "民法/3.担保物権/3.54-62",
        "category": "民法",
        "subfolder": "3.担保物権",
        "title": "集合物譲渡担保と所有権留保",
        "citation": "藤野、父ちゃんの会社",
        "tags": [
            "物権法",
            "担保物権",
            "譲渡担保",
            "所有権留保"
        ],
        "filePath": "民法/3.担保物権/3.54-62.js",
        "lastModified": "2025-11-15T16:35:23.003Z",
        "modelAnswers": []
    },
    {
        "id": "行政法/1.総論・行政作用法/1.1-9",
        "originalId": "行政法/1.総論・行政作用法/1.1-9",
        "category": "行政法",
        "subfolder": "1.総論・行政作用法",
        "title": "法律による行政の原理",
        "citation": "ハラセン、いきなり撤去っ",
        "tags": [
            "行政法",
            "法律による行政の原理",
            "法律の留保"
        ],
        "filePath": "行政法/1.総論・行政作用法/1.1-9.js",
        "lastModified": "2025-09-22T12:46:52.578Z",
        "modelAnswers": []
    },
    {
        "id": "行政法/1.総論・行政作用法/1.10-16",
        "originalId": "行政法/1.総論・行政作用法/1.10-16",
        "category": "行政法",
        "subfolder": "1.総論・行政作用法",
        "title": "委任立法と行政規則",
        "citation": "理央、それは委任の範囲外っ",
        "tags": [
            "行政法",
            "行政立法",
            "委任命令",
            "行政規則",
            "裁量基準"
        ],
        "filePath": "行政法/1.総論・行政作用法/1.10-16.js",
        "lastModified": "2025-09-15T13:25:50.150Z",
        "modelAnswers": []
    },
    {
        "id": "行政法/1.総論・行政作用法/1.17-22",
        "originalId": "行政法/1.総論・行政作用法/1.17-22",
        "category": "行政法",
        "subfolder": "1.総論・行政作用法",
        "title": "通達・行政規則",
        "citation": "ベア研、ルールにしばられるっ？",
        "tags": [
            "行政法",
            "行政作用法",
            "行政規則",
            "通達",
            "告示"
        ],
        "filePath": "行政法/1.総論・行政作用法/1.17-22.js",
        "lastModified": "2025-09-15T13:26:01.508Z",
        "modelAnswers": []
    },
    {
        "id": "行政法/1.総論・行政作用法/1.23-27",
        "originalId": "行政法/1.総論・行政作用法/1.23-27",
        "category": "行政法",
        "subfolder": "1.総論・行政作用法",
        "title": "行政行為",
        "citation": "ベア研、出店許可っ？",
        "tags": [
            "行政法",
            "行政行為",
            "許可",
            "特許",
            "認可",
            "確認"
        ],
        "filePath": "行政法/1.総論・行政作用法/1.23-27.js",
        "lastModified": "2025-09-15T13:26:16.734Z",
        "modelAnswers": []
    },
    {
        "id": "行政法/1.総論・行政作用法/1.28-31",
        "originalId": "行政法/1.総論・行政作用法/1.28-31",
        "category": "行政法",
        "subfolder": "1.総論・行政作用法",
        "title": "行政行為の効力",
        "citation": "理央、取り消しって何回言った？",
        "tags": [
            "行政法",
            "行政行為",
            "効力",
            "公定力"
        ],
        "filePath": "行政法/1.総論・行政作用法/1.28-31.js",
        "lastModified": "2025-09-15T13:28:04.282Z",
        "modelAnswers": []
    },
    {
        "id": "行政法/1.総論・行政作用法/1.32-36",
        "originalId": "行政法/1.総論・行政作用法/1.32-36",
        "category": "行政法",
        "subfolder": "1.総論・行政作用法",
        "title": "行政行為の効力",
        "citation": "ベア研、許可は絶対っ！",
        "tags": [
            "行政法",
            "行政行為",
            "拘束力",
            "不可争力",
            "不可変更力",
            "執行力"
        ],
        "filePath": "行政法/1.総論・行政作用法/1.32-36.js",
        "lastModified": "2025-09-15T13:28:13.784Z",
        "modelAnswers": []
    },
    {
        "id": "行政法/1.総論・行政作用法/1.37-42",
        "originalId": "行政法/1.総論・行政作用法/1.37-42",
        "category": "行政法",
        "subfolder": "1.総論・行政作用法",
        "title": "行政行為の瑕疵",
        "citation": "ベア研、立ち退き命令っ？",
        "tags": [
            "行政法",
            "行政行為",
            "瑕疵",
            "無効",
            "取消し"
        ],
        "filePath": "行政法/1.総論・行政作用法/1.37-42.js",
        "lastModified": "2025-09-15T13:31:15.799Z",
        "modelAnswers": []
    },
    {
        "id": "行政法/2.行政救済法/2.1-6",
        "originalId": "行政法/2.行政救済法/2.1-6",
        "category": "行政法",
        "subfolder": "2.行政救済法",
        "title": "取消訴訟の訴訟要件",
        "citation": "ベア研、お役所に物申す！？",
        "tags": [
            "行政法",
            "行政事件訴訟法",
            "取消訴訟",
            "処分性",
            "原告適格"
        ],
        "filePath": "行政法/2.行政救済法/2.1-6.js",
        "lastModified": "2025-08-30T10:55:35.050Z",
        "modelAnswers": []
    },
    {
        "id": "行政法/2.行政救済法/2.11-14",
        "originalId": "行政法/2.行政救済法/2.11-14",
        "category": "行政法",
        "subfolder": "2.行政救済法",
        "title": "取消訴訟の審理",
        "citation": "理央、行政とたたかうっ！？",
        "tags": [
            "行政法",
            "行政事件訴訟法",
            "取消訴訟"
        ],
        "filePath": "行政法/2.行政救済法/2.11-14.js",
        "lastModified": "2025-08-30T13:22:23.453Z",
        "modelAnswers": []
    },
    {
        "id": "行政法/2.行政救済法/2.15-19",
        "originalId": "行政法/2.行政救済法/2.15-19",
        "category": "行政法",
        "subfolder": "2.行政救済法",
        "title": "取消判決の効力と執行停止",
        "citation": "理央、判決のその先っ",
        "tags": [
            "行政法",
            "行政事件訴訟法",
            "取消訴訟",
            "判決の効力",
            "執行停止"
        ],
        "filePath": "行政法/2.行政救済法/2.15-19.js",
        "lastModified": "2025-08-30T14:54:43.518Z",
        "modelAnswers": []
    },
    {
        "id": "行政法/2.行政救済法/2.7-10",
        "originalId": "行政法/2.行政救済法/2.7-10",
        "category": "行政法",
        "subfolder": "2.行政救済法",
        "title": "訴えの利益",
        "citation": "新田、終わったはずの処分っス！",
        "tags": [
            "行政法",
            "行政事件訴訟法",
            "訴えの利益",
            "処分基準"
        ],
        "filePath": "行政法/2.行政救済法/2.7-10.js",
        "lastModified": "2025-08-30T12:06:52.485Z",
        "modelAnswers": []
    }
];
export const caseLoaders = {
    '刑事訴訟法/1.捜査/1.1-10': () => import(`./刑事訴訟法/1.捜査/1.1-10.js?v=${Math.random()}`),
    '刑事訴訟法/1.捜査/1.100-107': () => import(`./刑事訴訟法/1.捜査/1.100-107.js?v=${Math.random()}`),
    '刑事訴訟法/1.捜査/1.108-116': () => import(`./刑事訴訟法/1.捜査/1.108-116.js?v=${Math.random()}`),
    '刑事訴訟法/1.捜査/1.11-17': () => import(`./刑事訴訟法/1.捜査/1.11-17.js?v=${Math.random()}`),
    '刑事訴訟法/1.捜査/1.117-125': () => import(`./刑事訴訟法/1.捜査/1.117-125.js?v=${Math.random()}`),
    '刑事訴訟法/1.捜査/1.126-130': () => import(`./刑事訴訟法/1.捜査/1.126-130.js?v=${Math.random()}`),
    '刑事訴訟法/1.捜査/1.131-136': () => import(`./刑事訴訟法/1.捜査/1.131-136.js?v=${Math.random()}`),
    '刑事訴訟法/1.捜査/1.18-29': () => import(`./刑事訴訟法/1.捜査/1.18-29.js?v=${Math.random()}`),
    '刑事訴訟法/1.捜査/1.30-38': () => import(`./刑事訴訟法/1.捜査/1.30-38.js?v=${Math.random()}`),
    '刑事訴訟法/1.捜査/1.91-99': () => import(`./刑事訴訟法/1.捜査/1.91-99.js?v=${Math.random()}`),
    '刑事訴訟法/2.公訴・公判/2.1-6': () => import(`./刑事訴訟法/2.公訴・公判/2.1-6.js?v=${Math.random()}`),
    '刑事訴訟法/2.公訴・公判/2.13-20': () => import(`./刑事訴訟法/2.公訴・公判/2.13-20.js?v=${Math.random()}`),
    '刑事訴訟法/2.公訴・公判/2.21-25': () => import(`./刑事訴訟法/2.公訴・公判/2.21-25.js?v=${Math.random()}`),
    '刑事訴訟法/2.公訴・公判/2.26-31': () => import(`./刑事訴訟法/2.公訴・公判/2.26-31.js?v=${Math.random()}`),
    '刑事訴訟法/2.公訴・公判/2.50-60': () => import(`./刑事訴訟法/2.公訴・公判/2.50-60.js?v=${Math.random()}`),
    '刑事訴訟法/2.公訴・公判/2.61-68': () => import(`./刑事訴訟法/2.公訴・公判/2.61-68.js?v=${Math.random()}`),
    '刑事訴訟法/2.公訴・公判/2.69-73': () => import(`./刑事訴訟法/2.公訴・公判/2.69-73.js?v=${Math.random()}`),
    '刑事訴訟法/2.公訴・公判/2.7-12': () => import(`./刑事訴訟法/2.公訴・公判/2.7-12.js?v=${Math.random()}`),
    '刑事訴訟法/3.証拠法/3.1-8': () => import(`./刑事訴訟法/3.証拠法/3.1-8.js?v=${Math.random()}`),
    '刑事訴訟法/3.証拠法/3.103-108': () => import(`./刑事訴訟法/3.証拠法/3.103-108.js?v=${Math.random()}`),
    '刑事訴訟法/3.証拠法/3.20-23': () => import(`./刑事訴訟法/3.証拠法/3.20-23.js?v=${Math.random()}`),
    '刑事訴訟法/3.証拠法/3.24-28': () => import(`./刑事訴訟法/3.証拠法/3.24-28.js?v=${Math.random()}`),
    '刑事訴訟法/3.証拠法/3.86-91': () => import(`./刑事訴訟法/3.証拠法/3.86-91.js?v=${Math.random()}`),
    '刑事訴訟法/3.証拠法/3.9-19': () => import(`./刑事訴訟法/3.証拠法/3.9-19.js?v=${Math.random()}`),
    '刑事訴訟法/3.証拠法/3.92-96': () => import(`./刑事訴訟法/3.証拠法/3.92-96.js?v=${Math.random()}`),
    '刑事訴訟法/3.証拠法/3.97-102': () => import(`./刑事訴訟法/3.証拠法/3.97-102.js?v=${Math.random()}`),
    '刑事訴訟法/4.公判の裁判/4.1-7': () => import(`./刑事訴訟法/4.公判の裁判/4.1-7.js?v=${Math.random()}`),
    '刑事訴訟法/4.公判の裁判/4.14-18': () => import(`./刑事訴訟法/4.公判の裁判/4.14-18.js?v=${Math.random()}`),
    '刑事訴訟法/4.公判の裁判/4.8-13': () => import(`./刑事訴訟法/4.公判の裁判/4.8-13.js?v=${Math.random()}`),
    '刑法/6.個人的法益に関する罪/2.132-144': () => import(`./刑法/6.個人的法益に関する罪/2.132-144.js?v=${Math.random()}`),
    '刑法/6.個人的法益に関する罪/6.180-189': () => import(`./刑法/6.個人的法益に関する罪/6.180-189.js?v=${Math.random()}`),
    '刑法/6.個人的法益に関する罪/6.190-196': () => import(`./刑法/6.個人的法益に関する罪/6.190-196.js?v=${Math.random()}`),
    '刑法/6.個人的法益に関する罪/6.29-34': () => import(`./刑法/6.個人的法益に関する罪/6.29-34.js?v=${Math.random()}`),
    '刑法/6.個人的法益に関する罪/6.35-43': () => import(`./刑法/6.個人的法益に関する罪/6.35-43.js?v=${Math.random()}`),
    '刑法/6.個人的法益に関する罪/6.44-49': () => import(`./刑法/6.個人的法益に関する罪/6.44-49.js?v=${Math.random()}`),
    '刑法/6.個人的法益に関する罪/6.50-56': () => import(`./刑法/6.個人的法益に関する罪/6.50-56.js?v=${Math.random()}`),
    '刑法/6.個人的法益に関する罪/6.57-66': () => import(`./刑法/6.個人的法益に関する罪/6.57-66.js?v=${Math.random()}`),
    '刑法/6.個人的法益に関する罪/6.67-73': () => import(`./刑法/6.個人的法益に関する罪/6.67-73.js?v=${Math.random()}`),
    '刑法/7.社会的法益に関する罪/7.1-12': () => import(`./刑法/7.社会的法益に関する罪/7.1-12.js?v=${Math.random()}`),
    '刑法/7.社会的法益に関する罪/7.13-19': () => import(`./刑法/7.社会的法益に関する罪/7.13-19.js?v=${Math.random()}`),
    '刑法/7.社会的法益に関する罪/7.20-24': () => import(`./刑法/7.社会的法益に関する罪/7.20-24.js?v=${Math.random()}`),
    '刑法/7.社会的法益に関する罪/7.25-36': () => import(`./刑法/7.社会的法益に関する罪/7.25-36.js?v=${Math.random()}`),
    '刑法/8.国家的法益に関する罪/8.1-6': () => import(`./刑法/8.国家的法益に関する罪/8.1-6.js?v=${Math.random()}`),
    '刑法/8.国家的法益に関する罪/8.13-22': () => import(`./刑法/8.国家的法益に関する罪/8.13-22.js?v=${Math.random()}`),
    '刑法/8.国家的法益に関する罪/8.23-32': () => import(`./刑法/8.国家的法益に関する罪/8.23-32.js?v=${Math.random()}`),
    '刑法/8.国家的法益に関する罪/8.7-12': () => import(`./刑法/8.国家的法益に関する罪/8.7-12.js?v=${Math.random()}`),
    '商法/1.商法総則・商行為/1.1-11': () => import(`./商法/1.商法総則・商行為/1.1-11.js?v=${Math.random()}`),
    '商法/1.商法総則・商行為/1.12-18': () => import(`./商法/1.商法総則・商行為/1.12-18.js?v=${Math.random()}`),
    '商法/2.会社法総論・設立・株式/2.1-5': () => import(`./商法/2.会社法総論・設立・株式/2.1-5.js?v=${Math.random()}`),
    '商法/2.会社法総論・設立・株式/2.13-20': () => import(`./商法/2.会社法総論・設立・株式/2.13-20.js?v=${Math.random()}`),
    '商法/2.会社法総論・設立・株式/2.6-12': () => import(`./商法/2.会社法総論・設立・株式/2.6-12.js?v=${Math.random()}`),
    '商法/3.機関/3.1-8': () => import(`./商法/3.機関/3.1-8.js?v=${Math.random()}`),
    '商法/3.機関/3.16-20': () => import(`./商法/3.機関/3.16-20.js?v=${Math.random()}`),
    '商法/3.機関/3.21-27': () => import(`./商法/3.機関/3.21-27.js?v=${Math.random()}`),
    '商法/3.機関/3.28-35': () => import(`./商法/3.機関/3.28-35.js?v=${Math.random()}`),
    '商法/3.機関/3.36-44': () => import(`./商法/3.機関/3.36-44.js?v=${Math.random()}`),
    '商法/3.機関/3.45-51': () => import(`./商法/3.機関/3.45-51.js?v=${Math.random()}`),
    '商法/3.機関/3.52-55': () => import(`./商法/3.機関/3.52-55.js?v=${Math.random()}`),
    '商法/3.機関/3.56-59': () => import(`./商法/3.機関/3.56-59.js?v=${Math.random()}`),
    '商法/3.機関/3.60-67': () => import(`./商法/3.機関/3.60-67.js?v=${Math.random()}`),
    '商法/3.機関/3.68-72': () => import(`./商法/3.機関/3.68-72.js?v=${Math.random()}`),
    '商法/3.機関/3.9-15': () => import(`./商法/3.機関/3.9-15.js?v=${Math.random()}`),
    '商法/4.計算・資金調達・組織/4.1-8': () => import(`./商法/4.計算・資金調達・組織/4.1-8.js?v=${Math.random()}`),
    '商法/4.計算・資金調達・組織/4.17-20': () => import(`./商法/4.計算・資金調達・組織/4.17-20.js?v=${Math.random()}`),
    '商法/4.計算・資金調達・組織/4.21-27': () => import(`./商法/4.計算・資金調達・組織/4.21-27.js?v=${Math.random()}`),
    '商法/4.計算・資金調達・組織/4.9-16': () => import(`./商法/4.計算・資金調達・組織/4.9-16.js?v=${Math.random()}`),
    '民事訴訟法/1.序論～訴訟当事者/1.1-8': () => import(`./民事訴訟法/1.序論～訴訟当事者/1.1-8.js?v=${Math.random()}`),
    '民事訴訟法/1.序論～訴訟当事者/1.17-27': () => import(`./民事訴訟法/1.序論～訴訟当事者/1.17-27.js?v=${Math.random()}`),
    '民事訴訟法/1.序論～訴訟当事者/1.9-16': () => import(`./民事訴訟法/1.序論～訴訟当事者/1.9-16.js?v=${Math.random()}`),
    '民事訴訟法/2.訴えの提起/2.1-8': () => import(`./民事訴訟法/2.訴えの提起/2.1-8.js?v=${Math.random()}`),
    '民事訴訟法/2.訴えの提起/2.15-21': () => import(`./民事訴訟法/2.訴えの提起/2.15-21.js?v=${Math.random()}`),
    '民事訴訟法/2.訴えの提起/2.22-31': () => import(`./民事訴訟法/2.訴えの提起/2.22-31.js?v=${Math.random()}`),
    '民事訴訟法/2.訴えの提起/2.32-35': () => import(`./民事訴訟法/2.訴えの提起/2.32-35.js?v=${Math.random()}`),
    '民事訴訟法/2.訴えの提起/2.9-14': () => import(`./民事訴訟法/2.訴えの提起/2.9-14.js?v=${Math.random()}`),
    '民事訴訟法/3.訴訟の審理と進行/3.1-8': () => import(`./民事訴訟法/3.訴訟の審理と進行/3.1-8.js?v=${Math.random()}`),
    '民事訴訟法/3.訴訟の審理と進行/3.16-22': () => import(`./民事訴訟法/3.訴訟の審理と進行/3.16-22.js?v=${Math.random()}`),
    '民事訴訟法/3.訴訟の審理と進行/3.23-30': () => import(`./民事訴訟法/3.訴訟の審理と進行/3.23-30.js?v=${Math.random()}`),
    '民事訴訟法/3.訴訟の審理と進行/3.31-33': () => import(`./民事訴訟法/3.訴訟の審理と進行/3.31-33.js?v=${Math.random()}`),
    '民事訴訟法/3.訴訟の審理と進行/3.34-40': () => import(`./民事訴訟法/3.訴訟の審理と進行/3.34-40.js?v=${Math.random()}`),
    '民事訴訟法/3.訴訟の審理と進行/3.9-15': () => import(`./民事訴訟法/3.訴訟の審理と進行/3.9-15.js?v=${Math.random()}`),
    '民事訴訟法/4.訴訟の終了/4.1-8': () => import(`./民事訴訟法/4.訴訟の終了/4.1-8.js?v=${Math.random()}`),
    '民事訴訟法/4.訴訟の終了/4.18-24': () => import(`./民事訴訟法/4.訴訟の終了/4.18-24.js?v=${Math.random()}`),
    '民事訴訟法/4.訴訟の終了/4.25-32': () => import(`./民事訴訟法/4.訴訟の終了/4.25-32.js?v=${Math.random()}`),
    '民事訴訟法/4.訴訟の終了/4.9-17': () => import(`./民事訴訟法/4.訴訟の終了/4.9-17.js?v=${Math.random()}`),
    '民事訴訟法/5.請求・当事者の複数/5.46-51': () => import(`./民事訴訟法/5.請求・当事者の複数/5.46-51.js?v=${Math.random()}`),
    '民事訴訟法/5.請求・当事者の複数/5.64-73': () => import(`./民事訴訟法/5.請求・当事者の複数/5.64-73.js?v=${Math.random()}`),
    '民事訴訟法/5.請求・当事者の複数/5.74-80': () => import(`./民事訴訟法/5.請求・当事者の複数/5.74-80.js?v=${Math.random()}`),
    '民法/1.民法総則/1.65-75': () => import(`./民法/1.民法総則/1.65-75.js?v=${Math.random()}`),
    '民法/1.民法総則/1.83-95': () => import(`./民法/1.民法総則/1.83-95.js?v=${Math.random()}`),
    '民法/1.民法総則/1.96-113': () => import(`./民法/1.民法総則/1.96-113.js?v=${Math.random()}`),
    '民法/2.物権/2.32-42': () => import(`./民法/2.物権/2.32-42.js?v=${Math.random()}`),
    '民法/3.担保物権/3.1-10': () => import(`./民法/3.担保物権/3.1-10.js?v=${Math.random()}`),
    '民法/3.担保物権/3.11-19': () => import(`./民法/3.担保物権/3.11-19.js?v=${Math.random()}`),
    '民法/3.担保物権/3.20-29': () => import(`./民法/3.担保物権/3.20-29.js?v=${Math.random()}`),
    '民法/3.担保物権/3.30-36': () => import(`./民法/3.担保物権/3.30-36.js?v=${Math.random()}`),
    '民法/3.担保物権/3.37-48': () => import(`./民法/3.担保物権/3.37-48.js?v=${Math.random()}`),
    '民法/3.担保物権/3.49-53': () => import(`./民法/3.担保物権/3.49-53.js?v=${Math.random()}`),
    '民法/3.担保物権/3.54-62': () => import(`./民法/3.担保物権/3.54-62.js?v=${Math.random()}`),
    '行政法/1.総論・行政作用法/1.1-9': () => import(`./行政法/1.総論・行政作用法/1.1-9.js?v=${Math.random()}`),
    '行政法/1.総論・行政作用法/1.10-16': () => import(`./行政法/1.総論・行政作用法/1.10-16.js?v=${Math.random()}`),
    '行政法/1.総論・行政作用法/1.17-22': () => import(`./行政法/1.総論・行政作用法/1.17-22.js?v=${Math.random()}`),
    '行政法/1.総論・行政作用法/1.23-27': () => import(`./行政法/1.総論・行政作用法/1.23-27.js?v=${Math.random()}`),
    '行政法/1.総論・行政作用法/1.28-31': () => import(`./行政法/1.総論・行政作用法/1.28-31.js?v=${Math.random()}`),
    '行政法/1.総論・行政作用法/1.32-36': () => import(`./行政法/1.総論・行政作用法/1.32-36.js?v=${Math.random()}`),
    '行政法/1.総論・行政作用法/1.37-42': () => import(`./行政法/1.総論・行政作用法/1.37-42.js?v=${Math.random()}`),
    '行政法/2.行政救済法/2.1-6': () => import(`./行政法/2.行政救済法/2.1-6.js?v=${Math.random()}`),
    '行政法/2.行政救済法/2.11-14': () => import(`./行政法/2.行政救済法/2.11-14.js?v=${Math.random()}`),
    '行政法/2.行政救済法/2.15-19': () => import(`./行政法/2.行政救済法/2.15-19.js?v=${Math.random()}`),
    '行政法/2.行政救済法/2.7-10': () => import(`./行政法/2.行政救済法/2.7-10.js?v=${Math.random()}`)
};
